{
    "fun": [],
    "Amherst": [
        {
            "user": "heisenberg_21",
            "title": "Is UMass Amherst MS CS program worth the cost?",
            "text": "Hi,\n\nI've been accepted to both UMass Amherst and SUNY Buffalo for their MS in Computer Science programs starting Spring 2025. However, I'm thinking whether UMass's program justifies the higher cost compared to SUNY Buffalo's.\n\n* UMass Amherst: ~$70k per year vs SUNY Buffalo: ~$53k per year, both from the program estimates\n* From what I've gathered, UMass Amherst's program is highly regarded, and the courses offered look great compared to those at SUNY Buffalo. This true especially for AI/ML specialization \n* UMass clearly states MS students are ineligible for TA/RA positions vs SUNY Buffalo seems to offer possibilities for TA/RA positions (based on online research). However, students are eligible for on-campus job at UMass\n* SUNY Buffalo's program is 1.5 years, while UMass is a regular 2-year master's\n* UMass offers a terminal MS program, whereas SUNY Buffalo has a research-based track (which I got an admit to) \n\nI'd like to hear your opinions on these two programs. Do you think UMass Amherst's program justifies the extra cost? How significant is the difference between a terminal MS and a research-based MS for future career prospects? I'm trying to justify the extra cost UMass's program. Any insights are welcome, particularly from students/alumni at these programs!",
            "replies": [
                {
                    "user": "EvanestalXMX",
                    "text": "I can’t speak to SUNY , but $17K is going to be the tiniest fraction of your future earnings such that I would pick the best one for you.  \n\nMost likely you’ll start at $100K and go up from there.",
                    "replies": [
                        {
                            "user": "heisenberg_21",
                            "text": "Yeah, when you put it like that, it make sense to go with UMass. I'm just (perhaps needlessly) worried that things will go south post-grad employment-wise now that Trump will a president.",
                            "replies": [
                                {
                                    "user": "EvanestalXMX",
                                    "text": "If it does, and I doubt it will, $17K (or even $34K for two years) isn’t going to make or break you.  The UMass campus and research connections (and food!) are a real asset too.",
                                    "replies": [
                                        {
                                            "user": "heisenberg_21",
                                            "text": "Thank you for the encouraging words!",
                                            "replies": [
                                                {
                                                    "user": "EvanestalXMX",
                                                    "text": "Best of luck, I would ask in the SUNY forum too as I can’t speak to that school at all so I’m biased.",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "user": "AutoModerator",
                    "text": "- u/heisenberg_21 `Admissions or Prospective Student Posts` - [Is UMass Amherst MS CS program worth the cost?](https://www.reddit.com/r/umass/comments/1glvpfs/is_umass_amherst_ms_cs_program_worth_the_cost/)  \n\nHi,\n\nI've been accepted to both UMass Amherst and SUNY Buffalo for their MS in Computer Science programs starting Spring 2025. However, I'm thinking whether UMass's program justifies the higher cost compared to SUNY Buffalo's.\n\n* UMass Amherst: ~$70k per year vs SUNY Buffalo: ~$53k per year, both from the program estimates\n* From what I've gathered, UMass Amherst's program is highly regarded, and the courses offered look great compared to those at SUNY Buffalo. This true especially for AI/ML specialization \n* UMass clearly states MS students are ineligible for TA/RA positions vs SUNY Buffalo seems to offer possibilities for TA/RA positions (based on online research). However, students are eligible for on-campus job at UMass\n* SUNY Buffalo's program is 1.5 years, while UMass is a regular 2-year master's\n* UMass offers a terminal MS program, whereas SUNY Buffalo has a research-based track (which I got an admit to) \n\nI'd like to hear your opinions on these two programs. Do you think UMass Amherst's program justifies the extra cost? How significant is the difference between a terminal MS and a research-based MS for future career prospects? I'm trying to justify the extra cost UMass's program. Any insights are welcome, particularly from students/alumni at these programs!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/umass) if you have any questions or concerns.*",
                    "replies": []
                },
                {
                    "user": "itsgreater9000",
                    "text": "as someone in the industry right now, Trump is probably a net-benefit (as much as it pains me to say this). The company I'm working at is already discussing next steps on increasing hiring under him given they think he will generate a lot more economic activity.\n\nI think it's a completely inept stance since presidents within their specific term can rarely influence the economy in their short tenure (assuming his tenure doesn't, uh, increase in length).\n\ni will say SUNY Buffalo isn't a bad school. depending on your abilities or needs, SUNY Buffalo is fine, and at a 25% discount, it's not bad. I'll say UMass any day, but depending on your financial or family situation (e.g. family in NY or something), the UMass one seems to be a bit on the pricier side. But I enjoyed my time at UMass.",
                    "replies": []
                }
            ]
        },
        {
            "user": "Working_Success_3348",
            "title": "lease transfer/subletting Fieldstone Spring semester 2025 ",
            "text": "Graduating this semester so looking for someone to take over my 4b/4b lease at fieldstone. Rent is cheaper from transfer than market price if you are to apply for it and you can switch into any other floorplans you wish with a lower than market price.\n\n[https://www.fieldstoneslate.com/amherst/fieldstone-slate/floorplans/four-bedroom-c-987423/fp\\_name/occupancy\\_type/student/lease\\_term\\[id\\]/9180/lease\\_start\\_window\\[id\\]/8449/space\\_configuration\\_id/2/](https://www.fieldstoneslate.com/amherst/fieldstone-slate/floorplans/four-bedroom-c-987423/fp_name/occupancy_type/student/lease_term[id]/9180/lease_start_window[id]/8449/space_configuration_id/2/)",
            "replies": [
                {
                    "user": "AutoModerator",
                    "text": "- u/Working_Success_3348 `Off-Campus Housing` - [lease transfer/subletting Fieldstone Spring semester 2025 ](https://www.reddit.com/r/umass/comments/1gk7twl/lease_transfersubletting_fieldstone_spring/)  \n\nGraduating this semester so looking for someone to take over my 4b/4b lease at fieldstone. Rent is cheaper from transfer than market price if you are to apply for it and you can switch into any other floorplans you wish with a lower than market price. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/umass) if you have any questions or concerns.*",
                    "replies": []
                }
            ]
        },
        {
            "user": "fis04",
            "title": "MS in mechanical engineering",
            "text": "Good Day everyone, \n\nIm thinking of transferring from USF to Umass as the courses are limited at USF. Im curious of courses difficulty in umass Amherst specially in MS in mechanical engineering. Can anyone give me any feedback on it? ",
            "replies": [
                {
                    "user": "AutoModerator",
                    "text": "- u/fis04 `Majors` - [MS in mechanical engineering](https://www.reddit.com/r/umass/comments/1glbhwf/ms_in_mechanical_engineering/)  \n\nGood Day everyone, \n\nIm thinking of transferring from USF to Umass as the courses are limited at USF. Im curious of courses difficulty in umass Amherst specially in MS in mechanical engineering. Can anyone give me any feedback on it? \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/umass) if you have any questions or concerns.*",
                    "replies": []
                },
                {
                    "user": "luketerr8",
                    "text": "I took two as an undergrad. Solar power and aerospace fluids. Solar was a complete joke and I didn’t learn anything but you definitely can if you really try. Aerospace fluids was insanely cool and I learned a ton and it was hard.",
                    "replies": []
                }
            ]
        },
        {
            "user": "Kunaall",
            "title": "Dentist recommendations",
            "text": "Any good dentist anyone know and recommend? Preferably someone who also works with the university provided insurance? \nI need to get a plaque checkup. UHS just handed me list of all dentists in Amherst area without any recs/the ones who work with the insurance provider.\nThank you in advance ",
            "replies": [
                {
                    "user": "mcshanksshanks",
                    "text": "Not sure if you have your own car or if they even take your insurance but Wegryzn in Chicopee or Westfield are really good.",
                    "replies": [
                        {
                            "user": "Kunaall",
                            "text": "alright got it",
                            "replies": []
                        }
                    ]
                },
                {
                    "user": "sword_myth",
                    "text": "I've been going to Hampshire Meadow on rt 9 in Hadley. They're a married couple where the husband is the pediatric dentist and the wife is the adult dentist. They're relatively young, thus on board and up to speed with modern dentistry philosophy and practices. I've heard good things about the one on Amity street in downtown Amherst too.",
                    "replies": [
                        {
                            "user": "Kunaall",
                            "text": "alright, do they take the insurance from uni?",
                            "replies": []
                        }
                    ]
                },
                {
                    "user": "AutoModerator",
                    "text": "- u/Kunaall `Health & Wellness` - [Dentist recommendations](https://www.reddit.com/r/umass/comments/1gl89l7/dentist_recommendations/)  \n\nAny good dentist anyone know and recommend? Some who also works with the university provided insurance? \nI need to get a plaque checkup. UHS just handed me list of all dentists in Amherst area without any recs/the ones who work with the insurance provider.\nThank you in advance \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/umass) if you have any questions or concerns.*",
                    "replies": []
                },
                {
                    "user": "Berk-Laydee",
                    "text": "I love Valley Dentists of Belchertown. I'm not sure about whether they take university insurance, but you call the office and ask. The staff is very helpful and it's right on route 9 east. Idk if there are any bus stops nearby, but I've recommended them to so many people.",
                    "replies": [
                        {
                            "user": "Kunaall",
                            "text": "thank you, i will check it out",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "user": "ViolinistAlert9538",
            "title": "Should I transfer to Umass Amherst BS CS program ",
            "text": "Hi all, \n\nI am planning to transfer from ASU to Umass Amherst for BS CS program, I am a sophmore student and studying CS here, planning to figure out whether or not I should trasnfer there for the CS program. Wanted to understand the course work difficulty. Will it be a steep difference and will it be ok ? Apart from that, how is the placement rate for the university? I am an international student, an trying to figure out whether this will be a good move or not..",
            "replies": [
                {
                    "user": "Jacques114",
                    "text": "Before they changing the cs requirement , it was more difficult than most colleges(at least more difficult than pitt,University of Arizona and UWMadison(I transferred to UW) but it is good, you can learn more things than you learned in other colleges. When I took cs220,311 with Marius, I got depression.Two courses in UMass= three courses in UA, PITT, UW. Discrete Math in UW is like 1+1, but taught by Barrington at UMass was like calculus.",
                    "replies": [
                        {
                            "user": "Odd_Cartoonist8642",
                            "text": "Agree with this. CS at UMass is insane. Like trust me dude I got the best scores on the SAT. The best scores on the AP exams. This program will burn you to the ground. The amount of sheer work they expect from you is insane",
                            "replies": []
                        },
                        {
                            "user": "Jacques114",
                            "text": "funny thing was I could not transfer my courses taken at UMass to UW, because I learned more things in one course which does not satisfy UW courses syllabus.",
                            "replies": []
                        }
                    ]
                },
                {
                    "user": "MesteR4791",
                    "text": "good cs program best in public universities in north east, you will learn a lot if you don’t half ass your way through classes. Im not gonna say it’s easy bc it’s not, it’s not gruelingly challenging either, if you are smart you do well. idk how asu cs is but it might be a bit challenging at umass",
                    "replies": [
                        {
                            "user": "Odd_Cartoonist8642",
                            "text": "Disagree with this answer. Mainly because they don’t spend enough time emphasizing Leetcode and DS & Algorithms. The job market has changed. And them making us fight with our lives in 240 and 230 while also doing Leetcode is brutal. \n\nYou will leave here a genius. And you will know a lot more than in my opinion 99% of CS kids. However you will be worked to the ground. \n\nAnd in today’s job market Leetcode is what gives you a job. So juggling extremely hard classes, keeping a good GPA, with Leetcode is no easy task. \n\nOnly come here if you want to work like a dog and truly want to be the best. Source - someone who has had good internships with a high gpa. Most kids here are international so they aren’t grinding Leetcode like that. Also CS here is crazy math heavy and you really gotta be good - unlike most schools where it’s not nearly as hard. \n\nIf I just did school and didn’t have to grind Leetcode I don’t think I would struggle that much. But because like 80-90% of kids are international (do not be misled, this is the truth) they usually are just UCAs, internships in India, and do grad school. So for a domestic student you really gotta grind if you want good internships since you need to balance school with Leetcode",
                            "replies": [
                                {
                                    "user": "MulvaX",
                                    "text": "80 - 90% of the students in the undergraduate computer science major are not international. That is blatantly inaccurate. You may have made assumptions about people's international status, but it is just not true. There are a lot of US citizens who may be children of immigrants, but they are US citizens.",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "user": "MesteR4791",
                            "text": "source: uca for two years at core classes, and a research fellow",
                            "replies": []
                        }
                    ]
                },
                {
                    "user": "Odd_Cartoonist8642",
                    "text": "Not going to lie the major is really really hard at UMass Amherst. If you have to take the 200s and aren’t willing to work extremely hard I wouldn’t recommend transferring. I think it’s 80% + international students at UMass CS. I truly believe the students here are best of the best. I went to a top high school in MA, lots of AP classes - with top AP scores, and top grades and UMass CS is truly a different level of hard. \n\nI believe Umass CS deserves more recognition. But it’s really hard. So this is the best answer",
                    "replies": [
                        {
                            "user": "MulvaX",
                            "text": "There are 25% international students in UMass CICS. There are US citizens from various ethnic backgrounds.",
                            "replies": []
                        }
                    ]
                },
                {
                    "user": "AutoModerator",
                    "text": "- u/ViolinistAlert9538 `Courses, rename this to Letters-###,  CS-230  HIS-112 etc.` - [Should I transfer to Umass Amherst BS CS program ](https://www.reddit.com/r/umass/comments/1gkdbdo/should_i_transfer_to_umass_amherst_bs_cs_program/)  \n\nHi all, \n\nI am planning to transfer from ASU to Umass Amherst for BS CS program, I am a sophmore student and studying CS here, planning to figure out whether or not I should trasnfer there for the CS program. Wanted to understand the course work difficulty. Will it be a steep difference and will it be ok ? Apart from that, how is the placement rate for the university? I am an international student, an trying to figure out whether this will be a good move or not..\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/umass) if you have any questions or concerns.*",
                    "replies": []
                },
                {
                    "user": "KSRP2004",
                    "text": "CS pretty easy here",
                    "replies": []
                }
            ]
        },
        {
            "user": "ROptimistic",
            "title": "UMass Amherst MSCS - Does It Accept Anyone? ",
            "text": "I've always heard such positive things about the MS in Computer Science program at UMass Amherst, so when I was admitted and confirmed my spot, I was genuinely excited. Recently, though, I've come across some mixed reviews, with some people suggesting that the program accepts 'just anyone' and primarily exists to support the PhD program financially. I’d really appreciate some honest feedback from current students or alumni who have been through it. Is this true? How was your experience? Did you find the program valuable and worthwhile? And has it been helpful in your career? Any insights would be greatly appreciated!",
            "replies": [
                {
                    "user": "Joe_H-FAH",
                    "text": "From the most recent admissions report for Fall '24 CICS had 3636 applicants for their masters degree program, 600 were accepted.  So not \"just anyone\" was accepted.  241 of those enrolled in CICS.  Average GREs from those who reported scores were 166 Math, 156 Verbal.\n\nThe \"primarily exists to support the PhD program financially\" is a mischaracterization of the situation.  The PhD program is supported through research and university funds being used to provide assistantships to PhD or MS/PhD track students.  MS CS degree candidates who do not have to do research or a masters thesis by policy normally do not get assistantships.  Their tuition is being used to support and fund the MS program.  They can apply for jobs as graders after their first semester, otherwise they are able to work regular student jobs and apply for applicable financial aid to partly pay for the program.",
                    "replies": [
                        {
                            "user": "ROptimistic",
                            "text": "Thank you for pointing out the admissions report. I went ahead and downloaded it, and seeing those numbers really put things into perspective and honestly made me feel better. I also appreciate your explanation about the funding structure—it makes a lot more sense now.\n\nRegarding the master’s thesis, it’s not to my knowledge that UMass offers a thesis track. Please correct me if I’m wrong. Do you happen to know anyone who went on to do their PhD at UMass or another school after completing the MS here? I’ve heard it can be challenging to get into a PhD program without a thesis-based master’s, and I’m also curious if research opportunities are limited for master’s students at UMass.",
                            "replies": [
                                {
                                    "user": "Joe_H-FAH",
                                    "text": "I haven't looked closely at CICS's grad degree offerings.  I do know that some of the other schools and colleges at UMass do offer a masters degree w/ thesis track and provide some funding to those grad students.\n\nGlancing at the MS CS description it looks like CICS does not specifically have a thesis requirement for their MS CS.  But they do offer options for independent study research or a Masters Project done with one or two professors as either a paper or research.  Possibly contacting the program or others may get you more information on that.  But I personally don't know any recent grads from the CICS programs, the ones I knew were ages ago in the late '80s and early '90s.  The program has changed quite a bit since then.\n\nThe MS/PhD track does mention students getting involved in research from the beginning.  It appears that track uses the initial research to develop into the PhD dissertation.",
                                    "replies": [
                                        {
                                            "user": "ROptimistic",
                                            "text": "Thank you for the detailed reply! I did read about the concentrations, and I’ll reach out to my advisor to learn more about them. I’ll also contact the program directly to understand more about the research opportunities and see how they align with my goals. The MS/PhD track sounds interesting with its early research focus; since I applied for the MS only, switching tracks might be a bit challenging, but I might give it a try. Thanks again for sharing!",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "user": "garden_province",
                    "text": "MS/MA programs in general, at every school, in every subject, are good sources of tuition dollars for colleges and universities",
                    "replies": [
                        {
                            "user": "ROptimistic",
                            "text": "Looks like master’s students are every university’s favorite donors!",
                            "replies": []
                        },
                        {
                            "user": "godoft42",
                            "text": "I know many MS students in the Math department who are funded.",
                            "replies": []
                        }
                    ]
                },
                {
                    "user": "Seeplusplush",
                    "text": "Are you international",
                    "replies": [
                        {
                            "user": "Any-Canary6286",
                            "text": "Does the answer change if op is international?",
                            "replies": [
                                {
                                    "user": "Seeplusplush",
                                    "text": "Yes",
                                    "replies": [
                                        {
                                            "user": "Any-Canary6286",
                                            "text": "Interesting, would you elaborate?",
                                            "replies": [
                                                {
                                                    "user": "Seeplusplush",
                                                    "text": "Companies dont sponsor",
                                                    "replies": [
                                                        {
                                                            "user": "ROptimistic",
                                                            "text": "What do you mean by that? I’m curious, how does my immigration status relate to whether the school accepts anyone or has high criteria? And what does any of this have to do with companies that don’t sponsor? Just trying to understand the reasoning here!",
                                                            "replies": [
                                                                {
                                                                    "user": "MulvaX",
                                                                    "text": "The person who said \"companies don't sponsor\" is referring to jobs after completing the MS in CS. International graduates can use something called OPT to legally get a job in the US after graduating from undergrad or graduate academic programs in the US but, after the OPT period expires, a company will need to pay to sponsor a visa for a non-US citizen employee. The process for obtaining that visa can take a long time and is not guaranteed (there are limits to the numbers granted by the US government) and so many companies do not consider non-citizens for their positions.\nThere are plenty of international graduates who do get jobs in the US after completing the MS on CS, but it is often more difficult and their options are more limited than domestic students. I don't want to sound too pessimistic about the US job opportunities for international graduates but want to be realistic. CICS Careers would be a good place to check for more information. They have a dashboard on their website that shows what companies hired international students over the past few years.",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "user": "AutoModerator",
                    "text": "- u/ROptimistic `Admissions or Prospective Student Posts` - [UMass Amherst MSCS - Does It Accept Anyone? ](https://www.reddit.com/r/umass/comments/1ghccxr/umass_amherst_mscs_does_it_accept_anyone/)  \n\nI've always heard such positive things about the MS in Computer Science program at UMass Amherst, so when I was admitted and confirmed my spot, I was genuinely excited. Recently, though, I've come across some mixed reviews, with some people suggesting that the program accepts 'just anyone' and primarily exists to support the PhD program financially. I’d really appreciate some honest feedback from current students or alumni who have been through it. Is this true? How was your experience? Did you find the program valuable and worthwhile? And has it been helpful in your career? Any insights would be greatly appreciated!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/umass) if you have any questions or concerns.*",
                    "replies": []
                },
                {
                    "user": "PristineAd1284",
                    "text": "It feels so. It did accept Tier 1 students with work ex and also accepted Tier 3 students w 8 GPA with No work ex. The peer group is mixed. Great students are accepting the school because of research but really the way are accepting everyone else is really questionable. This spring it was very clear.",
                    "replies": [
                        {
                            "user": "MulvaX",
                            "text": "What do you mean by Tier 1 and Tier 3? How are you qunatifying that? What is 8 GPA? I'm not arguing against you; I just don't understand most of your response, particularly \"but really the way are accepting everyone else is really questionable.\" Could you elaborate?",
                            "replies": [
                                {
                                    "user": "PristineAd1284",
                                    "text": "So in India, we have schools of various reputation. Getting into IITs/ NITs is not everyone’s cup of tea. Literally 10k out 1.2 million get into such schools. And out of those 10k, 1k will be for computer science. So 1k out of 1.2 million are in Tier 1 CS. Now coming to Tier 3, it’s every other college that any one can get if you pay fee. Nothing special. No one in India knows their name. So you know the difference. The 8 GPA is out of 10. In Tier 3, getting 9.5/10 is also pretty easy. Getting a 4/4\n Is easy. The assignments are something no one cares and exams are normal. The tier 1 institutions have professors that are pretty solid. So, coming to UMass they have taken in Students from IITs CSE with work experience. And also a random student who hasn’t completed their graduation yet, studying, with 3 out of 4 GPA with no research experience or no internship experience got in. This spring, there are lots of such cases. Literally people who couldn’t find a job in India got into UMass. Where as there are also people who left job in FAANG and are coming to UMass. That’s why it’s mixed. The cohort size is fairly big, that’s why I assume this happened. I didn’t see any big rejects here in India. Every random guy who barely did anything got into UMass.",
                                    "replies": [
                                        {
                                            "user": "IllustratorNorth9241",
                                            "text": "This Indian mindset of categorizing colleges into tier 1 and tier 3 is frustrating. People from tier 3 colleges have also worked hard, secured their jobs, and put in significant effort to write strong SOPs. In your story, you mention about 1,000 students, but there are also unqualified ones who got into NITs and IITs simply because of their caste. Those who didn’t make it to NITs or IITs didn’t lose hope; they worked hard and applied to US universities where they believed they had a chance, regardless of their background.\n\nAdmissions committees have access to the entire application and evaluate each candidate through SOPs and personal statements—something you can’t judge just from a quick profile overview. If you’re heading to the US, it’s time to drop the old mindset and be open.",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "user": "ROptimistic",
                            "text": "Thank you for sharing your thoughts! Do you know if the Tier 3 student had a strong portfolio or unique background that might explain the lower GPA? One case doesn’t necessarily mean the school accepts ‘just anyone,’ especially after I read the admissions report from the previous term. It’s definitely an interesting discussion and something to keep in mind!",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "user": "MindGlum8809",
            "title": "Some hope I will get in? ",
            "text": "So I have a  cum gpa 3.66 , with 3.82 in senior  year. Excellent grades in the humanities, 2 foreign languages (2 fluently, 1 mediocre), some volunteering with refugees, 1 year student gov, 2 sports,  gap year working full time, + a good essay + good letters of recommendation.\nApplying for psychology, and alternate major for classics. \nDo you think I will get in UMass Amherst in one of my two majors ?? \nDeeply appreciate your sharing of thoughts! \nThank you!! ",
            "replies": [
                {
                    "user": "nicolas1324563",
                    "text": "Yes",
                    "replies": [
                        {
                            "user": "MindGlum8809",
                            "text": "Hey thanks!! Do you think i can get in psych??",
                            "replies": [
                                {
                                    "user": "nicolas1324563",
                                    "text": "Yep",
                                    "replies": [
                                        {
                                            "user": "MindGlum8809",
                                            "text": "Thanks!! What about aid? I am oos,  should I expect some need and merit if admitted?? Probably I will have a 0 SAI index.",
                                            "replies": [
                                                {
                                                    "user": "nicolas1324563",
                                                    "text": "Maybe chancellors scholarship?",
                                                    "replies": [
                                                        {
                                                            "user": "MindGlum8809",
                                                            "text": "Thank you! After full  1 year in MA as a student can i qualify for state grants, like mass grant ?",
                                                            "replies": [
                                                                {
                                                                    "user": "nicolas1324563",
                                                                    "text": "I don’t know, Google? I’m gonna assume no though",
                                                                    "replies": [
                                                                        {
                                                                            "user": "MindGlum8809",
                                                                            "text": "Ok thanks!!",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "user": "Joe_H-FAH",
                                                                    "text": "No.  Your residency is based on where you applied from and where your family lives.  So if you apply as an out-of-state student, you generally remain in that status.  There is an appeal process for example if your parents/guardian relocated to MA and a job in-state paying state taxes.  There are also policies for persons on active duty with the armed forces or those who become independent of their parents/guardians.  The last can require taking time off from school, working and living in MA for a year or more, and then applying for re-admittance.  You can read more on the residency policy here:\n\nhttps://www.umass.edu/bursar/undergraduate-residency",
                                                                    "replies": [
                                                                        {
                                                                            "user": "MindGlum8809",
                                                                            "text": "Very  detailed answer. Thank you!",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "user": "Conscious-Ear-9465",
                    "text": "You’re gonna get it lol",
                    "replies": [
                        {
                            "user": "MindGlum8809",
                            "text": "Thanks!! What about aid?? I am oos . Should I expect need / merit if admitted?  Do you think I can work 12-15h per week on/ off campus?",
                            "replies": [
                                {
                                    "user": "Ok_Philosophy5316",
                                    "text": "oos state is significantly more expensive than in-state but they tend give oos state students more aid, off and on campus jobs can be competitive but if you get one you should be able to work 12-15 hours a week.",
                                    "replies": [
                                        {
                                            "user": "MindGlum8809",
                                            "text": "Thanks!! If I get a work study award aren't they supposed to find me a job on campus? How much is payment per hour?",
                                            "replies": [
                                                {
                                                    "user": "Ok_Philosophy5316",
                                                    "text": "i think so but i’d double check, i work off campus at the moment and don’t know a lot about the work study programs on campus. Pay depend on the job but most jobs from what friends have told me, pay above 15 an hour.",
                                                    "replies": [
                                                        {
                                                            "user": "MindGlum8809",
                                                            "text": "Thanks!! What kind of jobs are around that pay decently??",
                                                            "replies": [
                                                                {
                                                                    "user": "Ok_Philosophy5316",
                                                                    "text": "i honestly don’t know anymore, i just \napplied to places on indeed and got hired eventually",
                                                                    "replies": [
                                                                        {
                                                                            "user": "MindGlum8809",
                                                                            "text": "Great, thanks!!",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "user": "Joe_H-FAH",
                                                    "text": "No, finding and keeping a job on campus is your responsibility.  You do have an advantage over non-WS students, the WS award subsidizes your pay at whichever department you get hired for.\n\nMost jobs pay minimum wage of $15 an hour, possibly a bit more if they have problems attracting applicants.  There are some that pay more but require some existing skills.  About the best paying student job is driving for the bus service, $21 an hour to start and they pay $16 an hour during training for a CDL.",
                                                    "replies": [
                                                        {
                                                            "user": "MindGlum8809",
                                                            "text": "Great thank you!",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "user": "Cautious_Cry1227",
                    "text": "That gpa will cum in handy",
                    "replies": [
                        {
                            "user": "MindGlum8809",
                            "text": "What do you mean? That it is enough to get in with good  aid ?",
                            "replies": []
                        }
                    ]
                },
                {
                    "user": "AutoModerator",
                    "text": "- u/MindGlum8809 `Admissions or Prospective Student Posts` - [Some hope I will get in? ](https://www.reddit.com/r/umass/comments/1gndvg2/some_hope_i_will_get_in/)  \n\nSo I have a  cum gpa 3.66 , with 3.82 in senior  year. Excellent grades in the humanities, 2 foreign languages (2 fluently, 1 mediocre), some volunteering with refugees, 1 year student gov, 2 sports,  gap year working full time, + a good essay + good letters of recommendation.\nApplying for psychology, and alternate major for classics. \nDo you think I will get in UMass Amherst in one of my two majors ?? \nDeeply appreciate your sharing of thoughts! \nThank you!! \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/umass) if you have any questions or concerns.*",
                    "replies": []
                },
                {
                    "user": "Joe_H-FAH",
                    "text": "If you want to compare your HS GPA with those listed as average for admittance to various majors, the state Dept of Higher Education has set a policy for calculating weighted GPAs.  They also have an online calculator here - https://www.mass.edu/forstufam/admissions/gpacalc.asp.  They do not include grades for courses like PE, just regular academic subjects.",
                    "replies": []
                }
            ]
        },
        {
            "user": "DaRealWild",
            "title": "How competitive is the Astronomy/Astrophysics program at Umass?",
            "text": "Hello, I'm a Massachusetts senior looking to apply to Umass Amherst for Astrophysics. My stats are definitely nowhere near great, with a pretty low GPA (2.9) and a mid-SAT score (1220). I've been passionate about Astronomy since I was young, and my ECs/essay heavily reflect that, with me being the president of the Astronomy Club and other things. My essay is about my passion for Astronomy and how I've stuck with it.\n\nAs the title says, I just wanted to know how competitive the Astronomy program is to get into. I know UMass has gotten harder over the years, but it is my top choice, and I would love to know if I even have a slim chance. Thank you so much!",
            "replies": [
                {
                    "user": "kanye_east48294",
                    "text": "I wouldn't consider it to be competitive. However, your stats will probably make it difficult to get accepted.\n\nIf you passionately conveyed your interest and commitment to astronomy/astrophysics, I think that would help you a lot. Being the president of an astronomy club is a guaranteed boost.\n\nEither way, I wish you luck and hope you get accepted.",
                    "replies": [
                        {
                            "user": "DaRealWild",
                            "text": "Thank you, I appreciate it.",
                            "replies": []
                        }
                    ]
                },
                {
                    "user": "AutoModerator",
                    "text": "- u/DaRealWild `Admissions or Prospective Student Posts` - [How competitive is the Astronomy/Astrophysics program at Umass?](https://www.reddit.com/r/umass/comments/1glhtzq/how_competitive_is_the_astronomyastrophysics/)  \n\nHello, I'm a Massachusetts senior looking to apply to Umass Amherst for Astrophysics. My stats are definitely nowhere near great, with a pretty low GPA (2.9) and a mid-SAT score (1220). I've been passionate about Astronomy since I was young, and my ECs/essay heavily reflect that, with me being the president of the Astronomy Club and other things. My essay is about my passion for Astronomy and how I've stuck with it.\n\nAs the title says, I just wanted to know how competitive the Astronomy program is to get in to. I know UMass has gotten harder over the years, but it is my top choice, and I would love to know if I even have a slim chance. Thank you so much!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/umass) if you have any questions or concerns.*",
                    "replies": []
                },
                {
                    "user": "RedDragon0814",
                    "text": "The astronomy program is quite good uni. If you have any questions, feel free to ask me about them since I’m a current junior at umass in astronomy",
                    "replies": [
                        {
                            "user": "DaRealWild",
                            "text": "Awesome thank you",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "user": "PristineAd1284",
            "title": "IMP — in terms of RoI, jobs",
            "text": "Could you please pick one and give reasoning. I have admits from UMass Amherst MSCS and Virginia Tech MSCS, Blacksburg.\n\nUMass doesn’t offer any sort of funding whatsoever. The tuition cost of both comes down to 55-60k $ for 2 years. \n\nI don’t have any funding currently at Virginia Tech. Dept’s saying currently there are no fundings for incoming spring students. But few said, it’s easy to get RAs later on, few said it’s tough.\n\nPlease add some comments or some suggestions. Really important.\n\n[View Poll](https://www.reddit.com/poll/1gmeoo2)",
            "replies": []
        },
        {
            "user": "Ok-Imagination-1294",
            "title": "advice on transferring to UMass Amherst as an education major, fall 2025",
            "text": "I'm curious to hear from anyone who's an education major how the program is. Also, for people who have transferred here, how was the social situation? I already know some people there but I'm scared since I'll be a transfer and wasn't with people their freshmen year making friends will be hard. Any advice on making friends as a transfer would be appreciated. \n\nI go to a very good liberal arts college for education majors right now, but it's not the best fit. The campus is very small and there isn't anything to do unless you take an hour-long train to NYC. Especially now that it's getting colder people are in their dorms more, and there are just not enough people or a good social scene here for me. On top of that, this school is extremely expensive whereas at Amherst I'd have in-state tuition. ",
            "replies": [
                {
                    "user": "AutoModerator",
                    "text": "- u/Ok-Imagination-1294 `Need Advice` - [advice on transferring to UMass Amherst as an education major, fall 2025](https://www.reddit.com/r/umass/comments/1gkej84/advice_on_transferring_to_umass_amherst_as_an/)  \n\nI'm curious to hear from anyone who's an education major how the program is. Also, for people who have transferred here, how was the social situation? I already know some people there but I'm scared since I'll be a transfer and wasn't with people their freshmen year making friends will be hard. Any advice on making friends as a transfer would be appreciated. \n\nI go to a very good liberal arts college for education right now, but it's not the best fit. The campus is very small and there isn't anything to do unless you take an hour-long train to NYC. Especially now that it's getting colder people are in their dorms more, and there are just not enough people or a good social scene here for me. On top of that, this school is extremely expensive whereas at Amherst I'd have in-state tuition. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/umass) if you have any questions or concerns.*",
                    "replies": []
                }
            ]
        },
        {
            "user": "wills_astro",
            "title": "Incoming Grad Student Looking for Musical Roommates",
            "text": "Hi! I’ll be a first year grad student in Astronomy starting Fall 2025. I’m coming from Madison, WI, and I’m looking for roommates for next year. The catch is, my main hobby is drumming. So, I’m looking to rent a house with a few other folks where I can keep and use my kit. If you’re a musician (or anyone!) interested in renting together, please comment below or reach out. \n\nI’m also wondering if UMass/the Amherst area has a centralized DIY music community. Here in Madison, we’ve got a discord that all the local bands and musicians are a part of that helps us connect, find people to play with, and can even help find housing. Is there some equivalent at UMass? Any other tips or advice on finding folks to jam with around UMass? ",
            "replies": [
                {
                    "user": "InA-M1nute-M4N",
                    "text": "You can check the SALT [discord](https://discord.gg/F3SZwYJH) (students for alternative music)",
                    "replies": []
                },
                {
                    "user": "AutoModerator",
                    "text": "- u/wills_astro `Off-Campus Housing` - [Incoming Grad Student Looking for Musical Roommates](https://www.reddit.com/r/umass/comments/1gi0fip/incoming_grad_student_looking_for_musical/)  \n\nHi! I’ll be a first year grad student in Astronomy starting Fall 2025. I’m coming from Madison, WI, and I’m looking for roommates for next year. The catch is, my main hobby is drumming. So, I’m looking to rent a house with a few other folks where I can keep and use my kit. If you’re a musician (or anyone!) interested in renting together, please comment below or reach out. \n\nI’m also wondering if UMass/the Amherst area has a centralized DIY music community. Here in Madison, we’ve got a discord that all the local bands and musicians are a part of that helps us connect, find people to play with, and can even help find housing. Is there some equivalent at UMass? Any other tips or advice on finding folks to jam with around UMass? \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/umass) if you have any questions or concerns.*",
                    "replies": []
                }
            ]
        },
        {
            "user": "seuylx-hgialxe",
            "title": "Struggling to find 2B2B Entire Unit [Spring 2025]",
            "text": "Hi, everyone!  \nI will join the University of Massachusetts Amherst \\[MSCS program\\], this Spring \\[i.e.: **January 2025**\\]. I am looking for an apartment & The following are our conditions:\n\n* **Entire Unit** with **2 Beds & 2 Baths** (we are a group of **4** \\- International Students - Indians)\n* Budget-friendly\n* Key amenities \\[heat, hot water, etc should be included\\]\n* Nearby Bus Stop or Near to campus\n* Good & Safe location\n\nWe are struggling to find 2 beds and 2 full baths!\n\nIf any senior/alumni can guide or anyone who is about to lease entire unit from January...\n\n\\[PS: we have searched almost all possible listings - most of good areas like boulders, brandywine, etc have either 1 bath or 1.5 bath only! we require 2 full bath\\]",
            "replies": [
                {
                    "user": "Joe_H-FAH",
                    "text": "Good luck, it was not a common configuration for apartments built in this area until very recently.  More common are 2 bedrooms with 1 or 1 1/2 bathrooms.  You are unlikely to find 2 BR w/ 2 full baths except in new  or recent construction, and those will be on the more expensive side like Fieldstone.",
                    "replies": []
                },
                {
                    "user": "AutoModerator",
                    "text": "- u/seuylx-hgialxe `Off-Campus Housing` - [Struggling to find 2B2B Entire Unit [Spring 2025]](https://www.reddit.com/r/umass/comments/1gmof06/struggling_to_find_2b2b_entire_unit_spring_2025/)  \n\nHi, everyone!  \nI will join the University of Massachusetts Amherst \\[MSCS program\\], this Spring \\[i.e.: **January 2025**\\]. I am looking for an apartment & The following are our conditions:\n\n* **Entire Unit** with **2 Beds & 2 Baths** (we are a group of **4** \\- International Students - Indians)\n* Budget-friendly\n* Key amenities \\[heat, hot water, etc should be included\\]\n* Nearby Bus Stop or Near to campus\n* Good & Safe location\n\nWe are struggling to find 2 beds and 2 full baths!\n\nIf any senior/alumni can guide or anyone who is about to lease entire unit from January...\n\n\\[PS: we have searched almost all possible listings - most of good areas like boulders, brandywine, etc have either 1 bath or 1.5 bath only! we require 2 full bath\\]\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/umass) if you have any questions or concerns.*",
                    "replies": []
                },
                {
                    "user": "d0v_06",
                    "text": "look into fieldstone",
                    "replies": [
                        {
                            "user": "seuylx-hgialxe",
                            "text": "Looked there! Going over budget a bit.\nBecause I heard more than 4 people are not allowed.",
                            "replies": [
                                {
                                    "user": "CherryChocolatePizza",
                                    "text": "It's a local bylaw that more than 4 unrelated people are not allowed to live in the same residence so that's not just a a Fieldstone rule.",
                                    "replies": [
                                        {
                                            "user": "seuylx-hgialxe",
                                            "text": "Oh, is that? Because I saw many students living in a single unit.\n\nThanks I was not aware of this thing!",
                                            "replies": [
                                                {
                                                    "user": "CherryChocolatePizza",
                                                    "text": "Not to say people don't get away with doing it, but there are also cases of people being evicted for it.",
                                                    "replies": [
                                                        {
                                                            "user": "seuylx-hgialxe",
                                                            "text": "Oh understood!",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "user": "seuylx-hgialxe",
                            "text": "Thanks though for suggesting out",
                            "replies": []
                        }
                    ]
                },
                {
                    "user": "M-Berels",
                    "text": "Idk if there’s any units available but Salem Place in Amherst has 2 beds, 2.5 baths. And the bedrooms are decent size too",
                    "replies": []
                }
            ]
        },
        {
            "user": "Ok_Dragonfly_6664",
            "title": "SELLING ITEMS/FREE/NEGOTIABLE ICLICKER AND MORE",
            "text": "Hi, I am trying to make some extra pocket money before I graduate and not carry so much back home, leaving Amherst **Dec 18th**, pick up on campus by then, thank you! Of course I am willing to give school supplies for **free/cheaper price** if needed. Prices are based on what the current market price was that I looked up and based on what I paid for. Cash, BofA/Zelle, Cashapp, Venmo, Paypal. Note items like iclicker or certain electronics I will not hand them off till **END of semester,** but do not need to pay till you receive it . Any questions feel free to ask in comments or dm thank you!!\n\nIclicker 2 - New/Good Condition, $10\n\nDual Monitors WITH stand - Good/Fair condition  Dell 60hz 24in, this is an older model. Original price for each was $90. One of monitors has a black streak from bottom but doesn't go past half way in height, used it as a discord display, barely noticeable. Other monitor no streak. Asking for $65 for the better monitor but it wont have a stand with it because I do not have it with me (can look for it at home and hope my parents didn’t throw it out), if want both it will have the stand $125. Negotiable. DM if want video/proof. This does NOT include hdmi, dp cables.\n\nHyperX QuadCast Mic : Good Condition Original price: $100, Asking for $85, Negotiable.\n\nTi-84 scientific calculator: Older model, no led screen good/fair condition. Gets the job done. Asking for $60, Negotiable\n\n**Going to put this out there since I’m getting comments about my prices specifically about my monitors**. \n\n1. If y’all don’t like the prices and the monitor isn’t for you, that’s fine. I don’t know why y’all think I’m shoving prices and saying no it’s a set price. I even put the reason why I said it. So if I badly priced it you can simply just say hey lower this pls :) \n2.  I even said multiple times, prices were negotiable. \n3. Goal was to make side money if I could. If I don’t sell that’s fine. Y’all can kindly scroll if this post isn’t for you.  Please don’t get nasty at me. \n4. I literally have used electronics like the mic and calculator and I even searched it up on Amazon/target what they were still selling for. And knocked it down. Did I also mention it could be free/lowered if needed? ",
            "replies": [
                {
                    "user": "AutoModerator",
                    "text": "r/umass does not monitor nor takes responsibility for any parts of transactions.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/umass) if you have any questions or concerns.*",
                    "replies": []
                },
                {
                    "user": "AnnualAd492",
                    "text": "Selling used electronics almost at full price. Seriously?? And they have damage on top of it….",
                    "replies": [
                        {
                            "user": "Ok_Dragonfly_6664",
                            "text": "OMG it’s almost like… there are other options annd people can make choices and prices are fully negotiable???? Y’all can’t read or what. Who said I’m forcing people to buy. I even said my reason to. When I bought it, it was $90 each. And I said the one is lowered. Also mentioned “negotiatable” idk why y’all mad. Just scroll? Y’all act I set hard prices. ",
                            "replies": []
                        }
                    ]
                },
                {
                    "user": "pyroshrew",
                    "text": "Dawg is selling cranberry juice like he’s a Walmart. Go donate to a food pantry if you have non-perishables you don’t want. I don’t think anyone is buying second-hand ramen on here.\n\nAlso, you can get a brand new 24-inch, 100 Hz monitor for the same price on Amazon: https://www.amazon.com/AOC-24B2H2-Frameless-1920x1080-Compatible/dp/B0C8ZJP65J/ref=mp_s_a_1_5?dib=eyJ2IjoiMSJ9.4fnCA7Yitgm_dFuYML3tMiVz7F1MelaPrc7llt42GiXRFJep6fm1Lr7UnRWH-SyDsN_D9jZ3MVFCpiceGNSunslsVegQ_MFIJczp_JkHHfrilFDaWX0STBeMEOlCcfwSP_dmgdsLC8ZOjBlkRMF-rXvjyw0COvZcnh5r-FAxDXwkOzM-oyITML349vcq1VgGBYUs1ZdEERE489hOxwRssg.NPiC2nfnfLVFjkMh3_3KPjXJ0N69BwDimbjy6Jp_vhk&dib_tag=se&keywords=60hz+monitor&qid=1731029176&sr=8-5",
                    "replies": [
                        {
                            "user": "Ok_Dragonfly_6664",
                            "text": "also no one forcing to buy anything if they don't like the price thats fine which i said was negotiable...",
                            "replies": []
                        },
                        {
                            "user": "Ok_Dragonfly_6664",
                            "text": "Dawg literally didnt have to comment and I said everything was negotiable or free if needed. The ramen is also like what they sell at harvest but obviously more variety like buldak. its free not to be a butt. I don't see whats wrong trying to make extra cash :)",
                            "replies": []
                        }
                    ]
                },
                {
                    "user": "AutoModerator",
                    "text": "- u/Ok_Dragonfly_6664 `Buying or Selling` - [SELLING ITEMS/FREE/NEGOTIABLE ICLICKER AND MORE](https://www.reddit.com/r/umass/comments/1gm4t6k/selling_itemsfreenegotiable_iclicker_and_more/)  \n\nHi, I am trying to make some extra pocket money before I graduate and not carry so much back home, leaving Amherst **Dec 18th**, pick up on campus by then, thank you! Of course I am willing to give school supplies for **free/cheaper price** if needed. Prices are based on what the current market price is.  Cash, BofA/Zelle, Cashapp, Venmo, Paypal. Note items like iclicker or certain electronics I will not hand them off till **END of semester,** but do not need to pay till you receive it . Any questions feel free to ask in comments or dm thank you!! \n\nIclicker 2 - New/Good Condition, $10\n\nOcean Spray Cranberry Juice (2x in stock) 1 for $3, 2 for $5\n\nCup Noodles (MICROWAVEABLE) Buldak Carbonara: $3 each, Shin Ramen $2 each, Tonkatsu Ramen: $3 each\n\nDual Monitors WITH stand - Good/Fair condition 60hz 24in, this is an older model. Original price for each was $90. One of monitors has a black streak from bottom but doesn't go past half way in height, used it as a discord display, barely noticeable. Other monitor no streak. Asking for $75 for the better monitor but it wont have a stand with it because I do not have it with me, if want both it will have the stand $140. Negotiable. DM if want video/proof. This does NOT include hdmi, dp cables. \n\nHyperX QuadCast Mic : Good Condition Original price: $100, Asking for $85, Negotiable. \n\nTi-84 scientific calculator: Older model, no led screen good/fair condition. Gets the job done. Asking for $60, Negotiable \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/umass) if you have any questions or concerns.*",
                    "replies": []
                },
                {
                    "user": "GSRoTu",
                    "text": "Try r/hardwareswap (read their rules) or facebook marketplace",
                    "replies": [
                        {
                            "user": "Ok_Dragonfly_6664",
                            "text": "Thanks for the advice.  I put it here because I’ve seen other students sell their items before on this Reddit. ",
                            "replies": []
                        }
                    ]
                },
                {
                    "user": "Manhwaworld1",
                    "text": "I need to start selling my stuff on r/umass",
                    "replies": [
                        {
                            "user": "Ok_Dragonfly_6664",
                            "text": "I mean no harm in it why complain? :/ seen people do it here all the time",
                            "replies": []
                        }
                    ]
                },
                {
                    "user": "Ok_Dragonfly_6664",
                    "text": "Going to put this out there since I’m getting comments about my prices specifically about my monitors. \n\n1. If y’all don’t like the prices and the monitor isn’t for you, that’s fine. I don’t know why y’all think I’m shoving prices and saying no it’s a set price. I even put the reason why I said it. So if I badly priced it you can simply just say hey lower this pls :) \n\n2.  I even said multiple times, prices were negotiable. \n\n3. Goal was to make side money if I could. If I don’t sell that’s fine. \n\n4. I literally have used electronics like the mic and calculator and I even searched it up on Amazon/target what they were still selling for. And knocked it down. DID I ALSO MENTION IT COULD BE FREE OR LOWERED IF NEEDED?? ",
                    "replies": [
                        {
                            "user": "Ok_Dragonfly_6664",
                            "text": "I don’t understand why people are thinking I’m evil. When I’m down to discuss and most likely 99.9% I will say sure let me lower price for you :)",
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ],
    "activities": [
        {
            "user": "MasterJack555",
            "title": "Paying for parking tickets with UCard Money?",
            "text": "I have a couple parking tickets and I'm curious if you can pay via the money on my UCard. When I went to parking services to switch my active vehicle, they accepted the UCard as a valid option to pay the $14 fee, so logically they should also accept it as legal tender for parking violations right?",
            "replies": [
                {
                    "user": "AutoModerator",
                    "text": "- u/MasterJack555 `Money` - [Paying for parking tickets with UCard Money?](https://www.reddit.com/r/umass/comments/1glz63d/paying_for_parking_tickets_with_ucard_money/)  \n\nI have a couple parking tickets and I'm curious if you can pay via the money on my UCard. When I went to parking services to switch my active vehicle, they accepted the UCard as a valid option to pay the $14 fee, so logically they should also accept it as legal tender for parking violations right?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/umass) if you have any questions or concerns.*",
                    "replies": []
                }
            ]
        }
    ],
    "places": [
        {
            "user": "doraemonko",
            "title": "Best restaurants to door dash/order from in the Amherst area?",
            "text": "I’ve been experimenting and ordering from random places to get a roster going but most have been misses. \n\nEdit: thanks for the recommendations everyone, I’ll check them out and work through them for the next 3 1/2 years! ",
            "replies": [
                {
                    "user": "coldwaterinaglass",
                    "text": "El comalito",
                    "replies": [
                        {
                            "user": "doraemonko",
                            "text": "Thanks, will try it out!",
                            "replies": [
                                {
                                    "user": "Hairy_Total6391",
                                    "text": "The biriya tacos are excellent.  Also the Thai basil fried rice from Crazy Noodle.",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "user": "Brady331",
                    "text": "La Veracruzana, Royal Chicken & Kebab, Hangar, Antonios, D.P. Dough",
                    "replies": [
                        {
                            "user": "CowboyandaCoffee29",
                            "text": "Heavy on La Veracruzana",
                            "replies": [
                                {
                                    "user": "bcxghlan",
                                    "text": "Another vote for Vera",
                                    "replies": []
                                },
                                {
                                    "user": "Brady331",
                                    "text": "Ordered enchiladas from them all the time, top tier",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "user": "TheRealArturis",
                            "text": "I will say D.P. Dough was trash in my opinion. Don't get the cinnamon sticks or the cheese sticks",
                            "replies": [
                                {
                                    "user": "Brady331",
                                    "text": "only ever got the calzones which were pretty good",
                                    "replies": [
                                        {
                                            "user": "TheRealArturis",
                                            "text": "Fair, my mistake for saying it's trash carte blanche",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "user": "MaryBala907",
                                    "text": "D.P. Dough is open pretty late.  \nIt taste so good cause i only order it when I'm barely awake and studying!",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "user": "ajc_617",
                    "text": "Mixed platter from royal chicken and kebab is a must try",
                    "replies": []
                },
                {
                    "user": "Honeycoveredberry",
                    "text": "taqueria del pueblo has some good mexican food. I’ve tried their burritos and birria tacos and they eat fr.",
                    "replies": []
                },
                {
                    "user": "Plastic-Panda-541",
                    "text": "Depends what you like. I used to order from hangar, although they had huge issues with the time being open on the app. I would also order from Its just wings, which was good for the price, though it is a ghost kitchen. I also used to order from oriental flavor and that was good for the price.",
                    "replies": [
                        {
                            "user": "doraemonko",
                            "text": "Thanks, will try them out!",
                            "replies": [
                                {
                                    "user": "Ok_Dragonfly_6664",
                                    "text": "Oriental flavor is closed for the time being bc of health inspection ",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "user": "abeyante",
                    "text": "Taste Thai is genuinely good. Alas, the best restaurant in town rn, Lili’s, doesn’t deliver. Try their egg tomato rice though, it’s life changing. Never thought that combo would work but I’m obsessed.",
                    "replies": [
                        {
                            "user": "Equal-Employee1443",
                            "text": "Omg yesssss! Love Lili’s and the egg tomato rice also changed my life 🤣😍🤤",
                            "replies": []
                        },
                        {
                            "user": "TheEmpressIsIn",
                            "text": "LIli's is indeed the best restaurant in town!",
                            "replies": []
                        }
                    ]
                },
                {
                    "user": "dharma_dude",
                    "text": "My go-tos are El Comalito, Garcia's, Ginger Garden, Paradise of India, & The Hangar. Royal Chicken & Kebab is a newcomer but has quickly become a favourite, their platters rock and so do their burgers & fried oreos, plus they're inexpensive as an added bonus. I dig Friendly's too but that's more of a local chain and part of it is nostalgia for me.\n\nHonourable mentions to Miss Florence Diner, Bub's BBQ, & Miss Saigon. Flo's is wonderful, just far away so it gets a bit pricey, so a once in a blue moon type of deal. Love their turkey clubs. Bub's is awesome too but even though they're closer the wait is usually long and it's also fairly pricey because it's BBQ. Miss Saigon is wonderful however they're not on doordash so you either have to go there or use Delivery Express, it's a local delivery service but their app is kinda janky.\n\nAnd finally a shout out to Pig Park BBQ in Ware. They don't deliver here because it's a bit of a hike but if you're hankering for BBQ they're worth trying, Bub's is great but they're even better as far as the meats go.\n\nEdit: oh! 110 Grill is great too, just pricey as far as portions go. I'd recommend eating in there, they have good drinks.",
                    "replies": []
                },
                {
                    "user": "Ginevra_Db",
                    "text": "Ginger Garden is great and pretty excellent sushi!",
                    "replies": []
                },
                {
                    "user": "Equal-Employee1443",
                    "text": "Miss Saigon only delivers w delivery express and they suck so don’t use them but it’s worth a trip uptown to eat there. The Pho Bo Sate is my absolute fav but the way they straddle Thai & Malaysian food is so amazing, every dish sings! Yeah I’ve tried basically everything on the menu. The owner is from Malaysia & works her butt off! Great fruit, milk & boba tea. All the recipes are her family’s & truly a family operation. I lived in Singapore & spent so much time in Malaysia, I was really bummed about moving home but this little spot just transports you. They’re closed on Mondays. \nAnother great spot to check out uptown Amherst is MOMOs, I don’t think they deliver either but their Lamb Momos (dumplings) will put a smile on your face for a straight 24hrs. If they still have their cold spicy noodles, a must try but they are spicy. They’re closed on Tuesdays. \nI also second Lili’s but no delivery.\nBueno is ALWAYS good & they’re on DoorDash & a few other delivery services, same with Antonio’s, the black sheep deli is on DoorDash too & while they’re mostly lunch hours, they’re wonderful & Formosa Chinese is nice authentic hunan style cuisine, also on DoorDash. Pita pockets is on DoorDash & so good, nicest family owned place, I always see the owner bringing unhoused ppl warm food for free. Also Fresh side is a must try! Some of the best pad Thai I’ve ever had, everything there is great. Stay away from panda east; they used to be great but way past their prime, I picked up takeout the other day & the smell inside there is so rancid I couldn’t even eat what I got.",
                    "replies": [
                        {
                            "user": "CherryChocolatePizza",
                            "text": "Second for Fresh Side.",
                            "replies": []
                        }
                    ]
                },
                {
                    "user": "AutoModerator",
                    "text": "- u/doraemonko `In the Area` - [Best restaurants to door dash/order from in the Amherst area?](https://www.reddit.com/r/umass/comments/1gi0dq2/best_restaurants_to_door_dashorder_from_in_the/)  \n\nI’ve been experimenting and ordering from random places to get a roster going but most have been misses. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/umass) if you have any questions or concerns.*",
                    "replies": []
                },
                {
                    "user": "granolasloot",
                    "text": "Joy Bowl (sushi bowls) in Hadley, Formosa Chinese in downtown Amherst (best combo is the Formosa Gua bao and the crystal shrimp dumplings, I would drive back there just for that meal)",
                    "replies": []
                },
                {
                    "user": "TheRealArturis",
                    "text": "The Korean Fried Chicken from House of Teriyaki is the best munchies food ",
                    "replies": []
                },
                {
                    "user": "EngineNo2947",
                    "text": "taquiera del pueblo has bomb ass tacos",
                    "replies": []
                },
                {
                    "user": "Training_Sail_5996",
                    "text": "I love Athenas,  Garcia's and my newly found favorite is IYA.",
                    "replies": []
                },
                {
                    "user": "alifetogarden",
                    "text": "Pasta e pasta & joybowl are some faves",
                    "replies": []
                },
                {
                    "user": "Ham549",
                    "text": "Panda East",
                    "replies": []
                },
                {
                    "user": "Iplaythebaboon",
                    "text": "110 grill had bogo burgers last I checked and they’re quite good",
                    "replies": []
                },
                {
                    "user": "Manhwaworld1",
                    "text": "Bro has infinite money",
                    "replies": []
                }
            ]
        },
        {
            "user": "Silviae_",
            "title": "Anything horrifically wrong with Olympia place?",
            "text": "Besides the price, is there anything egregiously wrong with Olympia Place, such as appliance/maintenance issues or super bad management?\n\nI figure alot of off campus housing management is gonna suck, but I was wondering why the reviews were so horrific.",
            "replies": [
                {
                    "user": "Fast_Angle2994",
                    "text": "They have had problems with fleas. Additionally, the window blinds are see-through, so it is possible for others to see what you are doing, especially at night. I know this because I lived there and the apartments were furnished, at the time.\n\nThe appliances were also not that great, especially the laundry machines. Honestly, the only “pro” was that the kids with wealthy parents would throw away their furniture and luxury clothes at the end of the year, so you could find some cool stuff in the trash room lol",
                    "replies": [
                        {
                            "user": "k-u-sh",
                            "text": "My first day there I accidentally saw people get intimate through the window and quickly closed my blinds and looked away. Kept closing the blinds in mind ever since.",
                            "replies": []
                        }
                    ]
                },
                {
                    "user": "k-u-sh",
                    "text": "I lived there for a year, I don't have many complaints. The laundry machine in your unit will take 6 hours, but it's an integrated washer and dryer. Maintainance is quick and easy. Pest control is frequent, but the surrounding areas mainly being forests do not help. A bit too far from campus and the surrounding area got super dark at night, so there's that.\n\nI did live in a single with my partner though, so there's that.",
                    "replies": []
                },
                {
                    "user": "Latter-Upside",
                    "text": "I lived there for 2 years and one of there other properties for another year. Generally they are very good. The walls and ceilings are pretty noise proof. I never gave or received a noise complaint. Management is quick to respond to most issues.\n\nMy biggest issues are with the place are,\n\n1.) the laundry machines are not good. They “work” but not very well. It take a a long time to do a not so big load, and they are still wet most of the time even after a 3 hour dry. This is because they don’t have air vents for the dryer. So it’s not really a dryer but it says it is. But I just went to the laundry parlor instead.\n\n2.) other house appliance are so so, shower head didn’t have great pressure or consistency. Dishwasher wasn’t always great but I could fix that myself. Mostly little stuff. \n\nUnlike the previous comments I never had a pest issue but I also lived in the 4th floor both years. So maybe that’s why.",
                    "replies": []
                },
                {
                    "user": "Fluid_Pepper8884",
                    "text": "i lived there last year. the only issue as other mentioned is the washing machine and dryer. i had 3 roommates and each of us took a whole day to do laundry. if your neighbours are a bunch of bastards you might get noise complaints. this guy living right below me snitched on us for loud music like 5 times, also called the cops twice. \n\nother than that i’d say it’s a great place. buses run every 20 minutes or so. i would recommend if you have the budget to buy a scooter. got me to campus in 5 mins. in the winters and rains tho you’ll have to take the bus. \n\nthey have a pool table, ping pong, vending machines, a printer, huge study spaces. \n\ncorrect me if i’m wrong but i heard the hiked the prices like crazy. when i lived there it was 1200",
                    "replies": [
                        {
                            "user": "Joe_H-FAH",
                            "text": "Current rent listed for a bedroom in a 4 bedroom apartment is $1350, so a bit over 10% more than what you say you paid.",
                            "replies": []
                        }
                    ]
                },
                {
                    "user": "AutoModerator",
                    "text": "- u/Silviae_ `Off-Campus Housing` - [Anything horrifically wrong with Olympia place?](https://www.reddit.com/r/umass/comments/1gkcspz/anything_horrifically_wrong_with_olympia_place/)  \n\nBesides the price, is there anything egregiously wrong with Olympia Place, such as appliance/maintenance issues or super bad management?\n\nI figure alot of off campus housing management is gonna suck, but I was wondering why the reviews were so horrific.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/umass) if you have any questions or concerns.*",
                    "replies": []
                },
                {
                    "user": "Perpetualshopper",
                    "text": "You may as well live in Fieldstone, which is IMO amazing and has very few downsides for just a bit more each month. Biggest perk: everyone gets their own bathroom",
                    "replies": []
                }
            ]
        },
        {
            "user": "just-some_redditor",
            "title": "calc 2 online at community college over winter break?",
            "text": "there was a post about this recently, but does anyone know for sure of a way to take the equivalent of math 132 online over winter break at a cc? there were mentions of northshore and salem, but i could not find anything about calc 2 being offered over the winter. i also searched a bunch of other places to no avail, but i might be a dumbass so idk. any advice would be appreciated thank ",
            "replies": [
                {
                    "user": "locomon0",
                    "text": "i did calculate 2 online at massasoit it was worth it imo, just make sure you take the calculus that is correct for your major",
                    "replies": []
                },
                {
                    "user": "AutoModerator",
                    "text": "- u/just-some_redditor `Academics` - [calc 2 online at community college over winter break?](https://www.reddit.com/r/umass/comments/1gj7f7h/calc_2_online_at_community_college_over_winter/)  \n\nthere was a post about this recently, but does anyone know for sure of a way to take the equivalent of math 132 online over winter break at a cc? there were mentions of northshore and salem, but i could not find anything about calc 2 being offered over the winter. i also searched a bunch of other places to no avail, but i might be a dumbass so idk. any advice would be appreciated thank \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/umass) if you have any questions or concerns.*",
                    "replies": []
                },
                {
                    "user": "Adventurous_Leek5288",
                    "text": "Look up MassTransfer on google, it gives you course equivalencies that can be transferred from a community college to Umass.",
                    "replies": []
                }
            ]
        },
        {
            "user": "ghost69man",
            "title": "Looking for a sublease (female only)",
            "text": "Hi, my friend is looking to sublease her room at Olympia place. She lives in a 4bd 2 bath unit. \n\nSpring 2025\n\nThe rest of her roommates are females so they prefer a new female roommate \n\nFor those who don’t know, Olympia is one of the best off campus stops as it is renovated, fully furnished, close to campus, easy access to bus, and student only apartment. \n\nMessage if interested and I can connect you to her about prices. \n\n",
            "replies": [
                {
                    "user": "AutoModerator",
                    "text": "r/umass does not monitor nor takes responsibility for any parts of transactions.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/umass) if you have any questions or concerns.*",
                    "replies": []
                },
                {
                    "user": "AutoModerator",
                    "text": "- u/ghost69man `Sublets, Room Swaps, & Housing Requests or Offers` - [Looking for a sublease (female only)](https://www.reddit.com/r/umass/comments/1gmsghs/looking_for_a_sublease_female_only/)  \n\nHi, my friend is looking to sublease her room at Olympia place. She lives in a 4bd 2 bath unit. \n\nThe rest of her roommates are females so they prefer a new female roommate \n\nFor those who don’t know, Olympia is one of the best off campus stops as it is renovated, fully furnished, close to campus, easy access to bus, and student only apartment. \n\nMessage if interested and I can connect you to her about prices. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/umass) if you have any questions or concerns.*",
                    "replies": []
                },
                {
                    "user": "Local-Pop-6357",
                    "text": "When would this be for? I need a place, but only for next fall semester",
                    "replies": [
                        {
                            "user": "ghost69man",
                            "text": "I forgot to include the time. It’s for spring 2025",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "user": "Significant-Meat6963",
            "title": "Loopholes to get out of On Campus housing?",
            "text": "I’m an out of state freshman technically with a dorm on campus. There’s drama with my roommate so I pretty much live off campus. I want to officially live off campus next semester at the place I’m staying at now. \nIf I’m (credit wise) a Sophmore next semester can that get me out of the housing requirement? Or are there any other loopholes people have used?\n\nEdit: they just approved my request for cancellation so I guess it is just purely based on credits and not being a first year student. ",
            "replies": [
                {
                    "user": "Joe_H-FAH",
                    "text": "This is a page on who is required to live on campus - https://www.umass.edu/living/assign/requirements.  It lists a number of groups automatically exempt from being required to live on campus.  That includes sophomores or above.  The only question is when they will let you use that status, it normally starts once you are listed as having 27 or more credits towards your degree.  So you may have to complete your semester grades if that is what is required to get you to 27 credits.",
                    "replies": [
                        {
                            "user": "ConsideringCS",
                            "text": "I’m pretty sure they use freshman as synonymous as first year. I’m a first year student who’s a sophomore and I was forced to live on campus",
                            "replies": [
                                {
                                    "user": "Joe_H-FAH",
                                    "text": "For academic purposes they specify a sophomore is anyone who has completed 27 to 56 credits, a junior is 57 to 86 credits, and a senior is 87+ credits.  So they are not completely synonymous.  It is only recently that ResLife has used \"first year\" a lot as so many incoming freshman students were coming in with many AP or other transfer credits.  So the policy states \"freshmen\" and definitely for your first semester they will consider an incoming \"first year\" as matching that whether or not you already have 27 or more credits.  After that first semester things get a bit fuzzier, the policy actually states \"freshmen\" and that has specific definitions elsewhere in terms of credits.  So you might find yourself able to move off campus if you really want to and can convince the exemptions committee.\n\nResLife has also started referring to \"second years\" in some places for the same reasons.",
                                    "replies": [
                                        {
                                            "user": "ConsideringCS",
                                            "text": "I meant synonymous in this case not in general lol but I was unclear in my original comment 😭😭😭",
                                            "replies": [
                                                {
                                                    "user": "Joe_H-FAH",
                                                    "text": "UMass Dining also uses the credits/class status for determining who are at least juniors and can purchase the YCMP meal plans on campus instead of Unlimited or DC Basic.  Same for those in on-campus apartments and who are not required to purchase a meal plan, juniors and seniors.  Some sophomore status students end up in North and still have to buy a meal plan.",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "user": "Significant-Meat6963",
                                    "text": "They just approved my request so I’m pretty sure it’s just based on credits.",
                                    "replies": [
                                        {
                                            "user": "ConsideringCS",
                                            "text": "Thanks for letting me know!",
                                            "replies": []
                                        },
                                        {
                                            "user": "Joe_H-FAH",
                                            "text": "Unless you applied weeks ago it must have been due to credits.  Normally the committee that approves exemption requests does them on the 3rd Friday of each month and lets people know the following week.",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "user": "AutoModerator",
                    "text": "- u/Significant-Meat6963 `Need Advice` - [Loopholes to get out of On Campus housing?](https://www.reddit.com/r/umass/comments/1gjpu03/loopholes_to_get_out_of_on_campus_housing/)  \n\nI’m an out of state freshman technically with a dorm on campus. There’s drama with my roommate so I pretty much live off campus. I want to officially live off campus next semester at the place I’m staying at now. \nIf I’m (credit wise) a Sophmore next semester can that get me out of the housing requirement? Or are there any other loopholes people have used?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/umass) if you have any questions or concerns.*",
                    "replies": []
                },
                {
                    "user": "secretaster",
                    "text": "You aren't required to live on campus?",
                    "replies": [
                        {
                            "user": "Significant-Meat6963",
                            "text": "Freshman are if they aren’t commuters",
                            "replies": [
                                {
                                    "user": "secretaster",
                                    "text": "Just say you commute problem solved? If you're not on campus... what am I missing?",
                                    "replies": [
                                        {
                                            "user": "Significant-Meat6963",
                                            "text": "You have to live with parents or a legal guardian. I’m out of state so they could question that. \nI got it approved because of my amount of credits.",
                                            "replies": [
                                                {
                                                    "user": "secretaster",
                                                    "text": "Ah I see",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "user": "Joe_H-FAH",
                            "text": "Basic policy is freshmen are required to live on campus.  However once a student has accumulated 27 or more credits they are considered sophomores.  With so many achievers coming in with AP or dual enrollment credits as part of their high school transcripts they have modified that to incoming first year students.  That means some are eligible to move off campus in the Spring.\n\nOthers exempt are married, divorced or separated students, students with dependents, veterans, and students living with their parents within 40 miles of campus and commuting.",
                            "replies": [
                                {
                                    "user": "secretaster",
                                    "text": "Gotcha thanks for sharing",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "user": "Equal-Employee1443",
                    "text": "I’m sure my mom would totally let u use our address for the commuter form “within 40 miles” of campus form. I think that’s a loophole. She’s pretty anti regulation ha",
                    "replies": []
                }
            ]
        }
    ]
}