{
    "anime": [],
    "club": [
        {
            "user": "DaRealWild",
            "title": "How competitive is the Astronomy/Astrophysics program at Umass?",
            "text": "Hello, I'm a Massachusetts senior looking to apply to Umass Amherst for Astrophysics. My stats are definitely nowhere near great, with a pretty low GPA (2.9) and a mid-SAT score (1220). I've been passionate about Astronomy since I was young, and my ECs/essay heavily reflect that, with me being the president of the Astronomy Club and other things. My essay is about my passion for Astronomy and how I've stuck with it.\n\nAs the title says, I just wanted to know how competitive the Astronomy program is to get into. I know UMass has gotten harder over the years, but it is my top choice, and I would love to know if I even have a slim chance. Thank you so much!",
            "replies": [
                {
                    "user": "kanye_east48294",
                    "text": "I wouldn't consider it to be competitive. However, your stats will probably make it difficult to get accepted.\n\nIf you passionately conveyed your interest and commitment to astronomy/astrophysics, I think that would help you a lot. Being the president of an astronomy club is a guaranteed boost.\n\nEither way, I wish you luck and hope you get accepted.",
                    "replies": [
                        {
                            "user": "DaRealWild",
                            "text": "Thank you, I appreciate it.",
                            "replies": []
                        }
                    ]
                },
                {
                    "user": "AutoModerator",
                    "text": "- u/DaRealWild `Admissions or Prospective Student Posts` - [How competitive is the Astronomy/Astrophysics program at Umass?](https://www.reddit.com/r/umass/comments/1glhtzq/how_competitive_is_the_astronomyastrophysics/)  \n\nHello, I'm a Massachusetts senior looking to apply to Umass Amherst for Astrophysics. My stats are definitely nowhere near great, with a pretty low GPA (2.9) and a mid-SAT score (1220). I've been passionate about Astronomy since I was young, and my ECs/essay heavily reflect that, with me being the president of the Astronomy Club and other things. My essay is about my passion for Astronomy and how I've stuck with it.\n\nAs the title says, I just wanted to know how competitive the Astronomy program is to get in to. I know UMass has gotten harder over the years, but it is my top choice, and I would love to know if I even have a slim chance. Thank you so much!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/umass) if you have any questions or concerns.*",
                    "replies": []
                },
                {
                    "user": "RedDragon0814",
                    "text": "The astronomy program is quite good uni. If you have any questions, feel free to ask me about them since I’m a current junior at umass in astronomy",
                    "replies": [
                        {
                            "user": "DaRealWild",
                            "text": "Awesome thank you",
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}