[
    {
        "header": "Introduction",
        "content": " Introduction  Hello! My name is Jasmine and I was a computer science major in the class of 2024. I compiled a list of my own personal experience in undergrad as well as information I think is the most important for incoming freshmen or transfers. Thank you to the people who added information to the document for stuff I missed :^) they’re credited within this document.  There was originally a Google Doc for this information, but I moved it all here. This page will be more updated than that Google Doc. On this page, I will attempt to explain all of the stuff I have learned over the course of my years at UMass. This is not only limited to the computer science major (and honors college), but UMass in general. I hope this is useful in some capacity :) I will be answering everything in a Question/Answer format, but if I don’t cover something please ask me. Please refer to the stickied table-of-contents to the right for sections on various topics.    FAQ Document Updates/TODOs   + Canvas explanation  - old Moodle & Blackboard explanation  + SpeedQueen explanation  + around campus section (thrift, restaurants/cafes, bookstores, farmers market, etc)  TODO misc clean up   "
    },
    {
        "header": "Before UMass",
        "content": " Before UMass     What are the important websites I need to know about or bookmark?     Moodle / MoonamiMost of your classes will have their class portal here. Similar to Canvas or Google Classroom if you’re acquainted with those.  BlackboardSome classes will use this instead of Moodle.   Canvas  Most of your classes will have their class portal here. This is where you will view most of your course modules, important documents, etc. Starting in Fall 2024, Canvas was made the official learning management system (LMS). Previously, it used to accompany Moodle/Moonami and Blackboard .    SPIRE  Most of your UMass important things will be here, i.e. final exam schedule, class schedule, class enrollment, on-campus housing selection, UCard/Spire ID information, making roommate groups, etc….    GET  Website to view transaction history, UDebit balance, meal swipes left, Dining Dollar balance, etc. You can also deposit money into your UDebit balance here. There is also a mobile app called GET Mobile.    UMass Dining  Menu for every place on campus, includes the time they're open, where they are, etc. The mobile app (UMass Dining) also shows how busy an area is via livestream cameras.    Academic Calendar  Tells you the academic year calendar. Useful for checking what schedule we follow after academic holidays, when breaks are, etc.    UMass Amherst Zoom  If you need to login to a Zoom/online meeting with your UMass email, login here. It's very common for you to be unable to login to Zoom classes or recordings due to your default email on your browser not being your umass[dot]edu email, so you can login here.    Patient Portal  This is where you will put your immunizations and other vaccine information.    Navigate  This is where you will make advising appointments (graduate school, general guidance, honors requirements, major requirements, etc).    Gradescope  Some classes require you to use this to view your grades/submit things/view your feedback on assignments. This is used in CS and Math classes to my knowledge, not sure about others.    OWL  Another website for homework and tests to be assigned. I know that chemistry and other lab science classes use this.    Piazza  Online forum where students can ask questions about projects as well as receive notes/information from instructors of the course. CS students use this. Some teachers use something similar called Campuswire .         What apps are a good idea to download on my phone before coming?      GET App  View transaction history, UDebit balance, meal swipes left, Dining Dollar balance, etc. Reload your UDebit balance here.    UMass Dining  Menu for every place on campus, includes the time they're open, where they are, how busy it is, etc. If you have dietary restrictions, the ingredients for each dish is also listed and you can personalize your own menu based off your dietary restrictions (be careful regardless, it isn't super vigilant about reporting these things).    Transit or Google Maps  Bus schedule and routes.    UMass Amherst App  Has a bunch of shortcuts to aforementioned apps and websites (i.e. SPIRE, Calendar). Personally, I don't think it's very useful.    SpeedQueen  If you put in your residence hall, you can see which laundry machines (both washer and dryer) are currently occupied and how much time they have left until their cycles finish. Useful for when you need to do laundry and to figure out when there's machines free.         What are some other things I should do before coming?        Making friends with your peers would be useful (via Discord, Instagram, etc…). Everyone's in the same boat as you and it would be nice to have someone to keep in touch with during the process.  Deposit some money into your UDebit account. Don't put too much, you really only need to put $20+ in at a time.            How do I get most of my UMass information and updates? What social medias can I follow or look at?      Your UMass email  Make sure to check it a lot.    r/umass  The UMass Amherst subreddit. There are a lot of people who ask a lot of questions there, so you can search a lot of things.    UMass Amherst Instagram  UMass Amherst Instagram    UMass Amherst Twitter  UMass Amherst Twitter    Discord  Join the 'Student Hub' to view UMass Discord servers and communities.    "
    },
    {
        "header": "Majors & Minors",
        "content": " Majors & Minors     I am undecided on an Exploratory track. How do I get into a major?     Depending on which college you're on the exploratory track for: [CLICK HERE]        What is a dual degree?     You have to do the major requirements for both majors and finish 150 credits (as opposed to 120). You only have to do one Junior Year Writing (JYW) requirement between the two degree programs.        What is a minor? What is the purpose of one? How do I declare it?     A minor is to demonstrate interest or proficiency in some field. A lot of classes are restricted to the major that the course is for, but minors can get into some (i.e. art minors can take art major classes). You do not get a paper/diploma that says your minor when you graduate. First, you reach out to the department. You need to fill out a minor intent form for what department you’re looking to minor in. If it gets approved, then you are good!   "
    },
    {
        "header": "Classes",
        "content": " Classes     What is AP credit used for? What is SAT II Subject test credit for? How can I tell if I scored high enough?     AP Credit is used to see if you can test out of classes. “UMass Amherst grants advanced standing and/or credit for the College Board AP exams, but these credits will vary depending upon scores and subject matter. You may also receive credit for your SAT II Foreign Language scores. Official copies of your AP and/or SAT Subject Test scores shou ld be sent electronically to UMass Amherst.” (Source) See this website to see if your test qualifies. You usually need a 3 or 4-5: here. See this one for SAT II: here.        What materials are required of each class? What is an access code?      SPIRE > Manage Classes > Classes & Finals Schedule > View My Classes > \"View/Purchase Textbooks\" button at the very top of the page. I would recommend waiting 'til close to the school semester start to see if you need to actually buy the textbooks, or even buy them after your first week of the semester. See the image below made by Andrew ('26) to see where the button is. An access code is a code that you input to some online portal to access your homework. This is pretty common for math classes. You need to buy the access code to access your homework Some of you guy might have heard about iClickers - An iClicker is a remote device that allows you to answer multiple choice questions during lectures (potential answers listed from A-E). DO NOT BUY AN ICLICKER IF YOU DO NOT NEED ONE! They are expensive devices, and sometimes the online iClicker website can act as a free substitute to the physical handheld device. I have only taken two CS classes that required an iClicker. Some classes and majors may vary, but do not buy if you do not need!         How do I take notes?      Depends on your major…I personally like typing my notes as well as handwriting so I have a touchscreen laptop. I used to use Evernote and OneNote, but have since switched to Obsidian. Other (computer science) people recommend Notion, LaTeX, emacs, and neovim.         How do I know what classes I'm supposed to take?      At UMass, there's 2 different types of requirements you need to meet to graduate. You need to fulfill your major requirements as well as a set of general education requirements , or gen-eds for short. Major requirements depend on your major, and you can typically look up tracking or what classes you need to take for your major. Gen-eds are classes that everyone needs to take across many different general categories. If you're a CS major, I mention specifically what is needed later on in the Computer Science Major section.         I have specific interests and I want to take specific classes pertaining to my interests. What classes should I take?      Check this out         What are credits? What do they mean? How many do I have to take? What is my Academic Level based off my credits?      Credits are usually indicative of a course's workload. Typically, you will see 4-credit courses (these usually mean several lecture sessions and one discussion section per week). Some are 3 (no discussion section). Seminars are 1 credit. Depending on your major and how intensive it is/how many courses you have to take, you will choose x number of courses per semester. Talk to your advisor about this. See your “Academic Level” based off your credits here . It depends on your total amount of credits, so your standing is based off the following: Freshman (0-26 credits), Sophomore (27-56 credits), Junior (57-86 credits), and Senior (87+ credits).         I came in with some credits for some classes (to my knowledge). How do I check if I actually got credit for it? How do I check where the rest of my requirements for gen-eds and major are?      SPIRE > Academics > General Academic Info > Academic Requirements (ARR). This page shows all the requirements that you have finished for your general education requirements, major requirements, and other requirements you may have (i.e. honors college). You can click the 'View Report as PDF' button at the top, scroll to the bottom, and find your AP/IB/etc... credit that you have from other places. Classes you have credit for will say 'CR' under the 'Grade' column.         How do I choose classes and enroll in classes? What is a shopping cart?      Choose classes based off your major requirements and general education requirements. The enrollment shopping cart is a way for you to “hold onto” the classes you want to take before you actually enroll in them. You will have a hold on your account until your advising appointment which will not allow you to enroll in any classes until the appointment. There are 2 ways of looking for classes: via SPIRE or Schedule Builder.  Selecting classes  SPIRE : Add, Drop, & Edit Classes > Search for Classes (Advanced) > search by course number, category, etc... > click on a class > add to shopping cart  Schedule Builder : \"Add Course\" button > search for your classes > \"Generate Schedules\" button > select a schedule you like > \"Send to Shopping Cart\" button  Enrolling in courses  SPIRE : Add, Drop, & Edit Classes > Shopping Cart > check the checkbox for every class you want to enroll in > \"Enroll\" button      General Education Classes     What gen-eds do I need to take?      General Education/Academic Requirements You need to take a class that covers each category of gen-eds. The categories are: - College Writing (CW) - Junior Year Writing (JYW) - R1 - R2 - Biological Science (BS) - Physical Science (PS) - Art/Literature (AT/AL) - Historical Science (HS) - Social & Behavioral Science (SB) - +1 more class that is either AT/AL, HS, or SB - Diversity US (DU) - Diversity Global (DG) You can sometimes double up with 2 gen-eds for one class, but you'd need to look at the gen-eds that each class covers. I made a spreadsheet to track this as well as honors requirements: CS & HONORS REQUIREMENTS Gen-Ed Fulfillment Requirements and Expectations List of classes and what gen-ed categories they cover What is R1 and R2?     "
    },
    {
        "header": "Living",
        "content": " Living     What do I bring to my dorm? What do I pack for my dorm? What will be there?      UMass suggested packing list . Here's a packing list I wrote: here .         What am I NOT allowed to bring to my dorm room?      Here.         What are the sizes of the beds?      Twin XL, so buy mattress covers/sheets accordingly. The bed is also 30.5\" high at its highest bunked point.         Is there Ethernet in the dorms? How do I connect to the WiFi?      No, only WiFi. Connect to the eduroam WiFi with your SPIRE ID and password. For the first time, you need to install a few things, though: Set up eduroam on Windows, Mac OS , iPhone/iPad, Android, and more If you have a device other than a laptop/PC or phone (i.e. gaming consoles, etc…), you'll need to connect your device and register it to the UMass Devices network: Connect Gaming Consoles & Streaming Devices to the Wireless Network         Can I bring my video game consoles? Can I bring a TV?      Yes. Depending on your workload though you might not have time for it.      What are the sizes of the beds?Twin XL, so buy mattress covers/sheets accordingly. The bed is also 30.5\" high at its highest bunked point.    Residential Areas & Residential Halls     What is a residential area? What is a residential/dorm hall?      There are 7 residential areas, which are groupings of different halls in different places on campus. They are: - Central - Commonwealth Honors College Residential Community (CHCRC) available only for people in the Commonwealth Honors College (CHC). - Northeast (NE) - Orchard Hill (OHill) - Southwest (SW or SWEST) - Sylvan - North In each residential area, there are a number of different halls, or dorm halls. Pictures of each residential area         I want to live in a specific hall in a specific residential area. What do I do?      You cannot select a specific hall in your preference application, but you can choose something like a living, learning community called a RAP (Residential Academic Programs) , since you will be placed in a specific hall with only people from the RAP. There are also special housing options you can select during the Housing Preference application such as: - 24-HR quiet floors - alcohol-free - break housing - economy triple - expanded housing - gender inclusive - single-sex housing - Spectrum (LGBTQA community)       RAPs & DRCs     What’s a RAP? What’s a Residential Academic Program? What kinds are there? How do I apply?      What is a RAP? What RAPs are available? How to Join a RAP?         What is a Defined Residential Community (DRC)?      “Defined Residential Communities (DRCs) are communities in residence halls where students can live with hall mates who share similar interests, backgrounds, and identities. The DRCs were originally created by UMass Amherst students and today serve as living and learning communities that support personal growth and academic success. These communities are not restricted by major and are open to all sophomore, junior and senior students interested in the particular focus area. DRCs are an ideal choice for students who are looking for a dynamic, hands-on way to learn about the variety of cultures and lifestyles represented at UMass Amherst.” (Source) These are saved for upperclassmen though usually.       Central Residential Area     I want to know more about Central.      “Close to mid-campus lies the Central Residential Area which is made up of nine traditionally-styled buildings. All Central residence halls are coed. However, Van Meter Hall has several female-only floors and male-only floors; Brett Hall is barrier-free and fully accessible for students with disabilities. Brett also offers Break (9-month) Housing (September through May).” (Source) FEATURES: - 4 first-year halls Butterfield , Gorman Hall , Van Meter Hall , Wheeler Hall - 5 multi-year halls Baker, Brett, Brooks, Chadbourne, Greenough - Specialty housing: Spectrum residential community - Greenough Sub Shop (student-run business) - Josephine White Eagle Native American Cultural Center in Chadbourne - New Africa House - The W.E.B. Du Bois Department of Afro-American Studies - there’s also an art gallery in here! Pictures: Facebook       Commonwealth Honors College Residential Community (CHCRC)     I want to know more about Commonwealth Honors College Residential Area.      “The first of its kind at UMass Amherst, the Commonwealth Honors College Residential Community (CHCRC) sits in the heart of campus, close to classrooms, the main library, and the Recreation Center. CHCRC creates a place for honors students to call home and for all of the campus to enjoy.” (Source)  FEATURES: - 2 first-year halls: Oak and Sycamore - 4 multi-year halls: Birch, Elm, Linden, Maple - honors advising center - CHC dean’s office and staff office - faculty office - 9 classrooms (in Elm) - Roots Cafe CLOSE TO: - library - recreation center (gym) - student union - Mullins center - fields - Yuri Kochiyama Cultural Center Multi-year halls have suites (suite-style and apartment-style). Suites have private bathrooms (toilet, shower, 2 sinks, large mirror) and common rooms. They are made up of double-style rooms and single-style rooms in each suite. Apartment-style suites come with a kitchen (fridge, oven, stove-top, kitchen sink, countertop, cabinets, microwave) as well as a kitchen table with 4 chairs. These are often not available to freshmen. Sophomores+ usually get this.        Northeast Residential Area (NE)     I want to know more about Northeast.      “The Northeast Residential Area is comprised of nine traditionally-styled buildings that form a quadrangle around a large grassy area known as the \"Quad\". Knowlton Hall has a barrier-free and accessible entrance.” (Source) FEATURES: - 6 first-year halls: Crabtree, Dwight, Hamin, Leach, Mary Lyon, Knowlton - 3 multi-year halls: Johnson, Lewis, Thatcher - DRC: Asian/Asian American Student Program in Lewis - Volleyball court CLOSE TO: - Campus Center - College of Engineering - College of Education - School of Public Health & Health Sciences - Totman Gym - Yuri Kochiyama Cultural Center - Worcester Dining Commons Pictures: Facebook Pictures       Orchard Hill Residential Area (OHill)     I want to know more about Orchard Hill.      “Overlooking campus, amid rolling hills and apple trees, is the Orchard Hill Residential Area. The area consists of four residence halls surrounding a central grassy area known as \"The Bowl.\" Each residence hall has seven floors with two corridors on each floor branching off from the lobby/elevator area in the center of the floor.” (Source) FEATURES: - 2 first-year halls: Dickinson, Webster - 2 multi-year halls: Grayson, Field - Sweets n' More (student-run business) in Field CLOSE TO: - Morrill Science Center - University Health Services (UHS) - Franklin Dining Commons - Worcester Dining Commons The double rooms feature: long desk (cannot be removed), floating shelf, 2 beds, 2 walk-in closets (hanging-bar, vanity w/ mirror, 3 drawers, cubbies), 2 windows (w/ blinds, can be opened), 2 rolling plastic chairs. OhillDouble Video that shows an old dorm 360 - no furniture is included except for what is mentioned above. Pictures: Facebook       Southwest Residential Area (SW, SWest)     I want to know more about Southwest.      “The Southwest Residential Area, the largest on campus, houses 5,500 students in its five high-rise towers, and eleven low-rise residence halls. All buildings are coed, although many offer single sex floors. Break Housing is available in James and Prince.” (Source) FEATURES: - 8 first-year halls: Melville, Thoreau, Pierpont , Moore, James, Emerson, Kennedy (tower), Cance - 8 multi-year halls: Coolidge (tower), Crampton, John Adams, John Quincy Adams (tower), MacKimmie, Patterson, Prince, Washington (tower) - DRC: Harambee (African Heritage Student Program) in Coolidge, El Barrio Community in Washington - Student Leadership Center in Moore Hall CLOSE TO: - Hampden Student Center - Latin American Cultural Center - Malcolm X Cultural Center - Southwest Area Government offices - Boyden Gym - Isenberg School of Management - Hampshire Dining Commons - Berkshire Dining Commons Pictures: Facebook       Sylvan Residential Area     I want to know more about Sylvan.      “Sylvan Residential Area offers suite-style living in a shady wooded area. Each residence hall contains 64 suites. Some suites are all-male, some all-female and some are co-ed. Each suite is a mixture of double and single rooms, a common bathroom, and a common living room. Suites accommodate from six to eight residents. Break Housing option is available in Cashin Hall.” (Source)  FEATURES: - 3 halls: Brown, Cashin, McNamara - suite-style halls (6-8 people each) - transfer/RFYE (residential first-year experience) in McNamara - basketball court - Sylvan Snack Bar (student-run business) in McNamara - wooded trails CLOSE TO: - College of Education - Totman Gym - Worcester Dining Commons Pictures: Facebook"
    },
    {
        "header": "Transportation",
        "content": " Transportation     How do you get around campus?      Walking  Everything is ~15-20 min walk usually.    Biking  A lot of people bring bikes. There are a lot of bike racks on campus. Bring your own lock. Be mindful of the paths between classes because there are a lot of people travelling around.    Skateboarding  A lot of people long-board, use pennyboards, or boosted boards. Same caution needs to be exercised to not hit people just like bikes.    Scooters  People bring scooters (especially electric ones).    Roller-skating  If it works out for you, sure.    ...Unicycling?  Go for it!    Bus  There's a system of PVTA buses that travel around campus. Download either the Google Maps or Transit app on your phone to keep track of where the buses are, where they stop, and when they depart/arrive.    "
    },
    {
        "header": "UCard & Dorm Key",
        "content": " UCard & Dorm Key     What is a UCard? What happens if I lose it?      Your student ID that basically lets you into everywhere (dining halls, your dorm building, etc…). You have to pay $30 for a replacement (see more.)  If you lose your UCard, you can typically call the number to get a same-day appointment, rather than using their scheduling. (Haylin '26)  You can also ask your Residential Service Desk (RSD) for your residential area for a temporary UCard. Just be sure to give it back after!         What is my key for? What happens if I lose it?      To get into your room. You have to pay $60 if you lose it (usually they spare you 2 times if you can get back your key…but after that you have to pay). Key and Card Access I got locked out of my room first day of being on campus freshman year (left key in room)…you have to go to the Residential Service Desk / RSD (that’s where you pick up packages) of your residential area, ask for a temporary key, then bring it back later after you find your original key.         How do I not lose these things?      Be careful. I have a lanyard that has a cardholder for my UCard and a ring for my key. I always make sure I have it before I leave. Also, I have a command hook on my door to my room so before I leave I always make sure to grab it.    "
    },
    {
        "header": "Methods of Payment",
        "content": " Methods of Payment     What different types of payment are there on my UCard?      Meal swipes, Dining Dollars, and UDebit.         I heard I don't have to eat only at the dining hall. How do I choose my method of payment (UDebit, Dining Dollars, Meal Swipe, credit card...?) at places that are not dining halls?      You can eat at places like Blue Wall, Harvest Market (both of which are in the Campus Center) or the various cafes on campus. The cashier will ask you before you make your purchase.      Meal Plans & Meal Swipes     What are meal swipes? What meal plan do I choose?      To get into a dining hall and actually be able to get food, you need to tap your UCard and use a “meal swipe” to get in. Dining halls are basically buffet-style, where you go to each station and get what food you want. Depending on your meal plan, that's how many meal swipes you will have. See more information about what each plan comes with and pricing at the link. Residential Meal Plans          Dining Dollars     What are dining dollars? Where can I use them?      Basically additional dining spending money that comes with some select meal plans that you can use at different places around UMass. There are places on campus that do not accept dining hall meal swipes that come with residential meal plans: Blue Wall (almost restaurant-style food), Harvest Market, and different Cafes around campus. You need to use dining dollars, UDebit, or your own money (cash, credit) for these places. Campus Center (Blue Wall and Harvest Market) menus Various cafes around campus menus       UDebit     What is UDebit used for? How do I add more to my UDebit balance?      Paying for random things (i.e. UMass store, cafes, Blue wall, vending machines), laundry, and printing services. Add more to your balance here.      "
    },
    {
        "header": "Food & Meals",
        "content": " Food & Meals   Dining Halls     Where and what are the dining halls? Are they any different?      There are 4 dining halls: - Worcester (“Woo”) - Franklin (“Frank”) - Hampshire (“Hamp”) - and Berkshire (“Berk”). They are located in these spots: dining_hall_map.pdf They typically have a lot of the same foods across each day (check the menu), but they usually do offer different meal courses.         What time do dining halls open?      7AM usually, closing time depends on location. Cafes and other places operate differently, check the times here.         Is there a menu for each place? How accurate is it?      Yes, the menus are online . There is also an app you can get on your phone called UMass Dining. Pretty accurate menu but sometimes wrong! Keep track of how many meal swipes, how many dining dollars, how much UDebit you have, etc… with the GET app on your phone or the website.       Non-Dining Halls     Tell me about the student-run businesses.      The student-run businesses at UMass are really good. My favorite cafe is People's Market, which is in the Student Union building (towards the side next to the campus pond). They have self-serve coffee and you can bring your own cup to fill for a slight discount on your drink :) Here are the other student businesses. I really like Sweets n' More in OHill (Field Hall). They have really good milkshakes :)         Are there vending machines? Where?      A lot of buildings have vending machines with various snacks and drinks. Your dorm hall will too. Some dorm halls have ice cream/pizza/burrito/hotdog vending machines (personally I would only get the ice cream since everything is frozen in those machines…). You can pay for things with UDebit OR your own cash.     "
    },
    {
        "header": "UMass Culture",
        "content": " UMass Culture     UMass has concerts?      UMass UPC plans a concert each semester. Spring 2022 was Jack Harlow. (UPC) If you're curious about other past concerts: UMass Spring Concert Lineups of the Decade         How do I know what events happen around campus?       UMass Library events Also look at a bunch of clubs' social media on Instagram. There's a lot of promotion there for different events with free stuff. Some include: - @umassupc University Programming Council - @umass_aasa Asian American Student Association - @umassbmcp Black Mass Communication Project - etc…         Did someone say free stuff?      directives:[]  There's a lot of free stuff given out around these areas: - outside Student Union - inside Student Union - in Campus Center I've gotten a lot of pencils, popsockets, flyers, stickers, pins, etc. There's also a lot of Library Events that hand out free stuff or other events hosted by organizations like University Programming Council (UPC). There are also a lot of events that happen during the semester that advertise free stuff.         Are there clubs I can join?      See an incomplete list of clubs here! Make sure to look on Instagram for the most up-to-date information on clubs usually!     "
    },
    {
        "header": "Around UMass Campus",
        "content": " Around UMass Campus     What can I do off-campus?      There's a lot of things you can do. There's a bunch of stuff in downtown Amherst like restaurants, small cafes that are perfect for studying in, a vintage shop , bookstores, a small toy shop, a few jewelry shops, etc. There's also several bar venues that have performances sometimes like The Drake (I saw a depthsofwikipedia show here before!). If you end up going downtown on a Saturday in the morning/early afternoon, there's the Amherst Farmers Market that runs from April 'til November, you can pick up some fresh fruit and groceries, plants, kombucha, sandwiches, baked goods, and more from there! There's also cities nearby like Northampton that has a bunch of cool restaurants and small eateries, thrift stores, bookstores, etc.     "
    }
]